# Essential tools
brew 'ack'
brew 'binutils'
brew 'coreutils'
brew 'git'
brew 'libevent'
brew 'libyaml'
brew 'multitail'
brew 'openssl'
brew 'readline'
brew 'sqlite'
brew 'tmux'
brew 'vim'
brew 'watch'

# Ruby
brew 'ruby-build'
brew 'rbenv'

# Python
brew 'python'
brew 'pyenv'
brew 'pyenv-virtualenv'

# Jvm
brew 'maven'
brew 'zinc'

# Elixir
brew 'elixir'

# Go
brew 'go'

# Platform
brew 'openshift-cli'
cask 'google-cloud-sdk'

# Casks
cask 'atom'
cask 'alfred'
cask 'dropbox'
cask 'docker'
cask 'flux'
cask 'karabiner-elements'
cask 'intellij-idea-ce'
cask 'iterm2'
cask 'pycharm-ce'
cask 'spotify'
cask 'sequel-pro'
cask 'visualvm'
cask 'virtualbox'
cask 'yourkit-java-profiler'

# Kubernetes
brew 'kubectl'
cask 'minikube'

# App store
mas '1Password', id: 443987910
mas 'Evernote', id: 406056744
mas 'Slack', id: 803453959
mas 'Textual 7', id: 1262957439
