# Essential tools
brew 'ack'
brew 'binutils'
brew 'coreutils'
brew 'git'
brew 'httpie'
brew 'libevent'
brew 'libyaml'
brew 'multitail'
brew 'openssl'
brew 'readline'
brew 'sqlite'
brew 'tmux'
brew 'vim'
brew 'watch'

# Casks
cask 'atom'
cask 'alfred'
cask 'dropbox'
cask 'flux'
cask 'karabiner-elements'
cask 'spotify'
cask 'sequel-pro'
cask 'virtualbox'
cask 'wireshark'

# App store
mas '1Password', id: 443987910
mas 'Evernote', id: 406056744
mas 'Slack', id: 803453959
mas 'Wunderlist', id: 410628904
mas 'Lingon', id: 450201424
