# Essential tools
brew 'ack'
brew 'binutils'
brew 'coreutils'
brew 'git'
brew 'libevent'
brew 'libyaml'
brew 'openssl'
brew 'readline'
brew 'sqlite'
brew 'tmux'
brew 'vim'
brew 'watch'

# Ruby
brew 'ruby-build'
brew 'rbenv'

# Python
brew 'pyenv'
brew 'pyenv-virtualenv'

# Jvm
brew 'maven'
brew 'zinc'

# Casks
cask 'atom'
cask 'alfred'
cask 'dropbox'
cask 'flux'
cask 'iterm2'
cask 'spotify'

# App store
mas '1Password', id: 443987910
mas 'Slack', id: 803453959
